Тест_ЗУП_31_КОРП/src/InformationRegisters/ОткликиКандидатов/ОткликиКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОткликиКандидатов</name>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>EMail</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ФайлРезюме</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ИсточникиИнформацииОКандидатах</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтклика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторРезюме</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Рассмотрено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АдресРезюме</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОтклика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/Catalogs/Кандидаты/Кандидаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кандидаты</name>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <type>
      <types>CatalogRef.ИсточникиИнформацииОКандидатах</types>
    </type>
  </attributes>
  <attributes>
    <name>Резюме</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РезюмеТекст</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейтинг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйДоход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРешения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийРешения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭтапРаботы</name>
    <type>
      <types>CatalogRef.ЭтапыРаботыСКандидатами</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.ПричиныОтклоненияКандидатов</types>
    </type>
  </attributes>
  <attributes>
    <name>СреднийРейтинг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРезюме</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Оценки</name>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/InformationRegisters/ОткликиКандидатов/Forms/ФормаОтклика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьАдресРезюме();
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьВидимостьФайлаРезюме(ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИсточникПриИзменении(Элемент)
	ОбновитьАдресРезюме();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗарегистрироватьКандидата(Команда)
	
	СозданКандидат = Ложь;
	ИнтеграцияРекрутинговыхСайтовКлиент.СоздатьКандидатаПоРезюме(Запись.ИдентификаторРезюме, Запись.Источник, Запись.Вакансия, СозданКандидат);
	
	Если СозданКандидат Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеКандидата = ПодборПерсоналаКлиентСервер.ОписаниеРезюмеКандидата();
	ЗаполнитьРезюмеКандидатаПоДаннымОтклика(ОписаниеКандидата);
	
	ПараметрыФормы = Новый Структура("СтруктураРезюме");
	ПараметрыФормы.СтруктураРезюме = ОписаниеКандидата;
	
	ОткрытьФорму("Справочник.Кандидаты.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлРезюме(Команда)
	ОткрытьФайлРезюмеНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьАдресРезюме()
	
	АдресРезюме = Запись.АдресРезюме;
	
	Если АдресРезюме = "" 
		И Запись.Источник = ИнтеграцияРекрутинговыхСайтовКлиентСервер.HeadHunter() Тогда
		
		АдресРезюме = "http://hh.ru/resume/" + Запись.ИдентификаторРезюме;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресРезюме) Тогда
		
		ЧастиСтроки = Новый Массив;
		ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(АдресРезюме, , , , АдресРезюме));
		
		Элементы.АдресРезюме.Заголовок = Новый ФорматированнаяСтрока(ЧастиСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	Элементы.АдресРезюме.Видимость = Не Элементы.АдресРезюме.Заголовок = "";
	
	ПодборПерсоналаФормы.УстановитьВидимостьЭлементаФормы(Элементы.ЗарегистрироватьКандидата);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьФайлаРезюме(ТекущийОбъект)
	
	ОписаниеФайла = ТекущийОбъект.ФайлРезюме.Получить();
	Если ОписаниеФайла = Неопределено Тогда
		Элементы.ОткрытьФайлРезюме.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	АдресФайлаРезюме = ПоместитьВоВременноеХранилище(ОписаниеФайла.Файл, УникальныйИдентификатор);
	ИмяФайлаРезюме = ОписаниеФайла.ИмяФайла;
	
	Элементы.ОткрытьФайлРезюме.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлРезюмеНаКлиенте()
	
	Если Не ЗначениеЗаполнено(АдресФайлаРезюме) Тогда
		Возврат;
	КонецЕсли;
	
	#Если Не ВебКлиент Тогда	
		Файл = ПолучитьИзВременногоХранилища(АдресФайлаРезюме);
		РасширениеИмениФайла = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ИмяФайлаРезюме);
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(РасширениеИмениФайла);
		Файл.Записать(ИмяВременногоФайла);
		ОбщегоНазначенияКлиент.ОткрытьФайлВПрограммеПросмотра(ИмяВременногоФайла);
	#Иначе
		ПолучитьФайл(АдресФайлаРезюме, ИмяФайлаРезюме);	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеКонтактнойИнформации()
	Возврат Новый Структура("Тип, Вид, Представление");
КонецФункции

&НаСервере
Процедура ЗаполнитьРезюмеКандидатаПоДаннымОтклика(ОписаниеКандидата)
	
	ОписаниеКандидата.Вакансия = Запись.Вакансия;
	ОписаниеКандидата.Фамилия = Запись.Фамилия;
	ОписаниеКандидата.Имя = Запись.Имя;
	ОписаниеКандидата.Отчество = Запись.Отчество;
	ОписаниеКандидата.Ответственный = Пользователи.ТекущийПользователь();
	ОписаниеКандидата.ДатаРегистрации = ТекущаяДатаСеанса();
	ОписаниеКандидата.ИсточникИнформации = Запись.Источник;
	ОписаниеКандидата.КонтактнаяИнформация = Новый Массив;
	
	Если ЗначениеЗаполнено(Запись.Адрес) Тогда
		Описание = ОписаниеКонтактнойИнформации();
		Описание.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		Описание.Вид = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица");
		Описание.Представление = Запись.Адрес;
		ОписаниеКандидата.КонтактнаяИнформация.Добавить(Описание);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.Телефон) Тогда
		Описание = ОписаниеКонтактнойИнформации();
		Описание.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		Описание.Вид = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица");
		Описание.Представление = Запись.Телефон;
		ОписаниеКандидата.КонтактнаяИнформация.Добавить(Описание);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.EMail) Тогда
		Описание = ОписаниеКонтактнойИнформации();
		Описание.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		Описание.Вид = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
		Описание.Представление = Запись.EMail;
		ОписаниеКандидата.КонтактнаяИнформация.Добавить(Описание);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
